setup/load_testing/reports/8080-imperative-sb-mysql-novt/8080_imperative-sb-mysql-novt.txt
--------------------------------
Summary report @ 09:25:28(+0200)
--------------------------------

errors.EADDRINUSE: ............................................................. 1581
errors.ETIMEDOUT: .............................................................. 23026
http.codes.200: ................................................................ 51882
http.codes.204: ................................................................ 478
http.codes.404: ................................................................ 11533
http.downloaded_bytes: ......................................................... 119551660
http.request_rate: ............................................................. 368/sec
http.requests: ................................................................. 88500
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 1393
  mean: ........................................................................ 48.1
  median: ...................................................................... 7
  p95: ......................................................................... 278.7
  p99: ......................................................................... 432.7
http.responses: ................................................................ 63893
vusers.completed: .............................................................. 63893
vusers.created: ................................................................ 88500
vusers.created_by_name.Delete a movie by id: ................................... 887
vusers.created_by_name.Get movies by id: ....................................... 61833
vusers.created_by_name.Get movies by page: ..................................... 17801
vusers.created_by_name.Save new movie: ......................................... 7979
vusers.failed: ................................................................. 24607
vusers.session_length:
  min: ......................................................................... 1.1
  max: ......................................................................... 2001.3
  mean: ........................................................................ 82
  median: ...................................................................... 8.2
  p95: ......................................................................... 459.5
  p99: ......................................................................... 1465.9